GopalSaraf/Practicals/PSDL/include/proc/pic18f6493.inc
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F6493_INC_
#define _PIC18F6493_INC_

/*
 * Assembly Header file for the Microchip PIC Microcontroller
 * PIC18F6493
 */

/*
 * Device Registers
 */

// Register: LCDPS
#define LCDPS LCDPS
LCDPS                                    equ 0F58h
// bitfield definitions
LCDPS_LP_POSN                            equ 0000h
LCDPS_LP_POSITION                        equ 0000h
LCDPS_LP_SIZE                            equ 0004h
LCDPS_LP_LENGTH                          equ 0004h
LCDPS_LP_MASK                            equ 000Fh
LCDPS_WA_POSN                            equ 0004h
LCDPS_WA_POSITION                        equ 0004h
LCDPS_WA_SIZE                            equ 0001h
LCDPS_WA_LENGTH                          equ 0001h
LCDPS_WA_MASK                            equ 0010h
LCDPS_LCDA_POSN                          equ 0005h
LCDPS_LCDA_POSITION                      equ 0005h
LCDPS_LCDA_SIZE                          equ 0001h
LCDPS_LCDA_LENGTH                        equ 0001h
LCDPS_LCDA_MASK                          equ 0020h
LCDPS_BIASMD_POSN                        equ 0006h
LCDPS_BIASMD_POSITION                    equ 0006h
LCDPS_BIASMD_SIZE                        equ 0001h
LCDPS_BIASMD_LENGTH                      equ 0001h
LCDPS_BIASMD_MASK                        equ 0040h
LCDPS_WFT_POSN                           equ 0007h
LCDPS_WFT_POSITION                       equ 0007h
LCDPS_WFT_SIZE                           equ 0001h
LCDPS_WFT_LENGTH                         equ 0001h
LCDPS_WFT_MASK                           equ 0080h
LCDPS_LP0_POSN                           equ 0000h
LCDPS_LP0_POSITION                       equ 0000h
LCDPS_LP0_SIZE                           equ 0001h
LCDPS_LP0_LENGTH                         equ 0001h
LCDPS_LP0_MASK                           equ 0001h
LCDPS_LP1_POSN                           equ 0001h
LCDPS_LP1_POSITION                       equ 0001h
LCDPS_LP1_SIZE                           equ 0001h
LCDPS_LP1_LENGTH                         equ 0001h
LCDPS_LP1_MASK                           equ 0002h
LCDPS_LP2_POSN                           equ 0002h
LCDPS_LP2_POSITION                       equ 0002h
LCDPS_LP2_SIZE                           equ 0001h
LCDPS_LP2_LENGTH                         equ 0001h
LCDPS_LP2_MASK                           equ 0004h
LCDPS_LP3_POSN                           equ 0003h
LCDPS_LP3_POSITION                       equ 0003h
LCDPS_LP3_SIZE                           equ 0001h
LCDPS_LP3_LENGTH                         equ 0001h
LCDPS_LP3_MASK                           equ 0008h
LCDPS_LCDPS0_POSN                        equ 0000h
LCDPS_LCDPS0_POSITION                    equ 0000h
LCDPS_LCDPS0_SIZE                        equ 0001h
LCDPS_LCDPS0_LENGTH                      equ 0001h
LCDPS_LCDPS0_MASK                        equ 0001h
LCDPS_LCDPS1_POSN                        equ 0001h
LCDPS_LCDPS1_POSITION                    equ 0001h
LCDPS_LCDPS1_SIZE                        equ 0001h
LCDPS_LCDPS1_LENGTH                      equ 0001h
LCDPS_LCDPS1_MASK                        equ 0002h
LCDPS_LCDPS2_POSN                        equ 0002h
LCDPS_LCDPS2_POSITION                    equ 0002h
LCDPS_LCDPS2_SIZE                        equ 0001h
LCDPS_LCDPS2_LENGTH                      equ 0001h
LCDPS_LCDPS2_MASK                        equ 0004h
LCDPS_LCDPS3_POSN                        equ 0003h
LCDPS_LCDPS3_POSITION                    equ 0003h
LCDPS_LCDPS3_SIZE                        equ 0001h
LCDPS_LCDPS3_LENGTH                      equ 0001h
LCDPS_LCDPS3_MASK                        equ 0008h

// Register: LCDCON
#define LCDCON LCDCON
LCDCON                                   equ 0F59h
// bitfield definitions
LCDCON_LMUX_POSN                         equ 0000h
LCDCON_LMUX_POSITION                     equ 0000h
LCDCON_LMUX_SIZE                         equ 0002h
LCDCON_LMUX_LENGTH                       equ 0002h
LCDCON_LMUX_MASK                         equ 0003h
LCDCON_CS_POSN                           equ 0002h
LCDCON_CS_POSITION                       equ 0002h
LCDCON_CS_SIZE                           equ 0002h
LCDCON_CS_LENGTH                         equ 0002h
LCDCON_CS_MASK                           equ 000Ch
LCDCON_WERR_POSN                         equ 0005h
LCDCON_WERR_POSITION                     equ 0005h
LCDCON_WERR_SIZE                         equ 0001h
LCDCON_WERR_LENGTH                       equ 0001h
LCDCON_WERR_MASK                         equ 0020h
LCDCON_SLPEN_POSN                        equ 0006h
LCDCON_SLPEN_POSITION                    equ 0006h
LCDCON_SLPEN_SIZE                        equ 0001h
LCDCON_SLPEN_LENGTH                      equ 0001h
LCDCON_SLPEN_MASK                        equ 0040h
LCDCON_LCDEN_POSN                        equ 0007h
LCDCON_LCDEN_POSITION                    equ 0007h
LCDCON_LCDEN_SIZE                        equ 0001h
LCDCON_LCDEN_LENGTH                      equ 0001h
LCDCON_LCDEN_MASK                        equ 0080h
LCDCON_LMUX0_POSN                        equ 0000h
LCDCON_LMUX0_POSITION                    equ 0000h
LCDCON_LMUX0_SIZE                        equ 0001h
LCDCON_LMUX0_LENGTH                      equ 0001h
LCDCON_LMUX0_MASK                        equ 0001h
LCDCON_LMUX1_POSN                        equ 0001h
LCDCON_LMUX1_POSITION                    equ 0001h
LCDCON_LMUX1_SIZE                        equ 0001h
LCDCON_LMUX1_LENGTH                      equ 0001h
LCDCON_LMUX1_MASK                        equ 0002h
LCDCON_CS0_POSN                          equ 0002h
LCDCON_CS0_POSITION                      equ 0002h
LCDCON_CS0_SIZE                          equ 0001h
LCDCON_CS0_LENGTH                        equ 0001h
LCDCON_CS0_MASK                          equ 0004h
LCDCON_CS1_POSN                          equ 0003h
LCDCON_CS1_POSITION                      equ 0003h
LCDCON_CS1_SIZE                          equ 0001h
LCDCON_CS1_LENGTH                        equ 0001h
LCDCON_CS1_MASK                          equ 0008h
LCDCON_LCDCS0_POSN                       equ 0002h
LCDCON_LCDCS0_POSITION                   equ 0002h
LCDCON_LCDCS0_SIZE                       equ 0001h
LCDCON_LCDCS0_LENGTH                     equ 0001h
LCDCON_LCDCS0_MASK                       equ 0004h
LCDCON_LCDCS1_POSN                       equ 0003h
LCDCON_LCDCS1_POSITION                   equ 0003h
LCDCON_LCDCS1_SIZE                       equ 0001h
LCDCON_LCDCS1_LENGTH                     equ 0001h
LCDCON_LCDCS1_MASK                       equ 0008h
LCDCON_LCDWERR_POSN                      equ 0005h
LCDCON_LCDWERR_POSITION                  equ 0005h
LCDCON_LCDWERR_SIZE                      equ 0001h
LCDCON_LCDWERR_LENGTH                    equ 0001h
LCDCON_LCDWERR_MASK                      equ 0020h
LCDCON_LCDSLPEN_POSN                     equ 0006h
LCDCON_LCDSLPEN_POSITION                 equ 0006h
LCDCON_LCDSLPEN_SIZE                     equ 0001h
LCDCON_LCDSLPEN_LENGTH                   equ 0001h
LCDCON_LCDSLPEN_MASK                     equ 0040h

// Register: LCDSE0
#define LCDSE0 LCDSE0
LCDSE0                                   equ 0F5Ah
// bitfield definitions
LCDSE0_LCDSE0_POSN                       equ 0000h
LCDSE0_LCDSE0_POSITION                   equ 0000h
LCDSE0_LCDSE0_SIZE                       equ 0008h
LCDSE0_LCDSE0_LENGTH                     equ 0008h
LCDSE0_LCDSE0_MASK                       equ 00FFh
LCDSE0_SE0_POSN                          equ 0000h
LCDSE0_SE0_POSITION                      equ 0000h
LCDSE0_SE0_SIZE                          equ 0001h
LCDSE0_SE0_LENGTH                        equ 0001h
LCDSE0_SE0_MASK                          equ 0001h
LCDSE0_SE1_POSN                          equ 0001h
LCDSE0_SE1_POSITION                      equ 0001h
LCDSE0_SE1_SIZE                          equ 0001h
LCDSE0_SE1_LENGTH                        equ 0001h
LCDSE0_SE1_MASK                          equ 0002h
LCDSE0_SE2_POSN                          equ 0002h
LCDSE0_SE2_POSITION                      equ 0002h
LCDSE0_SE2_SIZE                          equ 0001h
LCDSE0_SE2_LENGTH                        equ 0001h
LCDSE0_SE2_MASK                          equ 0004h
LCDSE0_SE3_POSN                          equ 0003h
LCDSE0_SE3_POSITION                      equ 0003h
LCDSE0_SE3_SIZE                          equ 0001h
LCDSE0_SE3_LENGTH                        equ 0001h
LCDSE0_SE3_MASK                          equ 0008h
LCDSE0_SE4_POSN                          equ 0004h
LCDSE0_SE4_POSITION                      equ 0004h
LCDSE0_SE4_SIZE                          equ 0001h
LCDSE0_SE4_LENGTH                        equ 0001h
LCDSE0_SE4_MASK                          equ 0010h
LCDSE0_SE5_POSN                          equ 0005h
LCDSE0_SE5_POSITION                      equ 0005h
LCDSE0_SE5_SIZE                          equ 0001h
LCDSE0_SE5_LENGTH                        equ 0001h
LCDSE0_SE5_MASK                          equ 0020h
LCDSE0_SE6_POSN                          equ 0006h
LCDSE0_SE6_POSITION                      equ 0006h
LCDSE0_SE6_SIZE                          equ 0001h
LCDSE0_SE6_LENGTH                        equ 0001h
LCDSE0_SE6_MASK                          equ 0040h
LCDSE0_SE7_POSN                          equ 0007h
LCDSE0_SE7_POSITION                      equ 0007h
LCDSE0_SE7_SIZE                          equ 0001h
LCDSE0_SE7_LENGTH                        equ 0001h
LCDSE0_SE7_MASK                          equ 0080h
LCDSE0_SEGEN0_POSN                       equ 0000h
LCDSE0_SEGEN0_POSITION                   equ 0000h
LCDSE0_SEGEN0_SIZE                       equ 0001h
LCDSE0_SEGEN0_LENGTH                     equ 0001h
LCDSE0_SEGEN0_MASK                       equ 0001h
LCDSE0_SEGEN1_POSN                       equ 0001h
LCDSE0_SEGEN1_POSITION                   equ 0001h
LCDSE0_SEGEN1_SIZE                       equ 0001h
LCDSE0_SEGEN1_LENGTH                     equ 0001h
LCDSE0_SEGEN1_MASK                       equ 0002h
LCDSE0_SEGEN2_POSN                       equ 0002h
LCDSE0_SEGEN2_POSITION                   equ 0002h
LCDSE0_SEGEN2_SIZE                       equ 0001h
LCDSE0_SEGEN2_LENGTH                     equ 0001h
LCDSE0_SEGEN2_MASK                       equ 0004h
LCDSE0_SEGEN3_POSN                       equ 0003h
LCDSE0_SEGEN3_POSITION                   equ 0003h
LCDSE0_SEGEN3_SIZE                       equ 0001h
LCDSE0_SEGEN3_LENGTH                     equ 0001h
LCDSE0_SEGEN3_MASK                       equ 0008h
LCDSE0_SEGEN4_POSN                       equ 0004h
LCDSE0_SEGEN4_POSITION                   equ 0004h
LCDSE0_SEGEN4_SIZE                       equ 0001h
LCDSE0_SEGEN4_LENGTH                     equ 0001h
LCDSE0_SEGEN4_MASK                       equ 0010h
LCDSE0_SEGEN5_POSN                       equ 0005h
LCDSE0_SEGEN5_POSITION                   equ 0005h
LCDSE0_SEGEN5_SIZE                       equ 0001h
LCDSE0_SEGEN5_LENGTH                     equ 0001h
LCDSE0_SEGEN5_MASK                       equ 0020h
LCDSE0_SEGEN6_POSN                       equ 0006h
LCDSE0_SEGEN6_POSITION                   equ 0006h
LCDSE0_SEGEN6_SIZE                       equ 0001h
LCDSE0_SEGEN6_LENGTH                     equ 0001h
LCDSE0_SEGEN6_MASK                       equ 0040h
LCDSE0_SEGEN7_POSN                       equ 0007h
LCDSE0_SEGEN7_POSITION                   equ 0007h
LCDSE0_SEGEN7_SIZE                       equ 0001h
LCDSE0_SEGEN7_LENGTH                     equ 0001h
LCDSE0_SEGEN7_MASK                       equ 0080h

// Register: LCDSE1
#define LCDSE1 LCDSE1
LCDSE1                                   equ 0F5Bh
// bitfield definitions
LCDSE1_LCDSE1_POSN                       equ 0000h
LCDSE1_LCDSE1_POSITION                   equ 0000h
LCDSE1_LCDSE1_SIZE                       equ 0008h
LCDSE1_LCDSE1_LENGTH                     equ 0008h
LCDSE1_LCDSE1_MASK                       equ 00FFh
LCDSE1_SE8_POSN                          equ 0000h
LCDSE1_SE8_POSITION                      equ 0000h
LCDSE1_SE8_SIZE                          equ 0001h
LCDSE1_SE8_LENGTH                        equ 0001h
LCDSE1_SE8_MASK                          equ 0001h
LCDSE1_SE9_POSN                          equ 0001h
LCDSE1_SE9_POSITION                      equ 0001h
LCDSE1_SE9_SIZE                          equ 0001h
LCDSE1_SE9_LENGTH                        equ 0001h
LCDSE1_SE9_MASK                          equ 0002h
LCDSE1_SE10_POSN                         equ 0002h
LCDSE1_SE10_POSITION                     equ 0002h
LCDSE1_SE10_SIZE                         equ 0001h
LCDSE1_SE10_LENGTH                       equ 0001h
LCDSE1_SE10_MASK                         equ 0004h
LCDSE1_SE11_POSN                         equ 0003h
LCDSE1_SE11_POSITION                     equ 0003h
LCDSE1_SE11_SIZE                         equ 0001h
LCDSE1_SE11_LENGTH                       equ 0001h
LCDSE1_SE11_MASK                         equ 0008h
LCDSE1_SE12_POSN                         equ 0004h
LCDSE1_SE12_POSITION                     equ 0004h
LCDSE1_SE12_SIZE                         equ 0001h
LCDSE1_SE12_LENGTH                       equ 0001h
LCDSE1_SE12_MASK                         equ 0010h
LCDSE1_SE13_POSN                         equ 0005h
LCDSE1_SE13_POSITION                     equ 0005h
LCDSE1_SE13_SIZE                         equ 0001h
LCDSE1_SE13_LENGTH                       equ 0001h
LCDSE1_SE13_MASK                         equ 0020h
LCDSE1_SE14_POSN                         equ 0006h
LCDSE1_SE14_POSITION                     equ 0006h
LCDSE1_SE14_SIZE                         equ 0001h
LCDSE1_SE14_LENGTH                       equ 0001h
LCDSE1_SE14_MASK                         equ 0040h
LCDSE1_SE15_POSN                         equ 0007h
LCDSE1_SE15_POSITION                     equ 0007h
LCDSE1_SE15_SIZE                         equ 0001h
LCDSE1_SE15_LENGTH                       equ 0001h
LCDSE1_SE15_MASK                         equ 0080h
LCDSE1_SEGEN8_POSN                       equ 0000h
LCDSE1_SEGEN8_POSITION                   equ 0000h
LCDSE1_SEGEN8_SIZE                       equ 0001h
LCDSE1_SEGEN8_LENGTH                     equ 0001h
LCDSE1_SEGEN8_MASK                       equ 0001h
LCDSE1_SEGEN9_POSN                       equ 0001h
LCDSE1_SEGEN9_POSITION                   equ 0001h
LCDSE1_SEGEN9_SIZE                       equ 0001h
LCDSE1_SEGEN9_LENGTH                     equ 0001h
LCDSE1_SEGEN9_MASK                       equ 0002h
LCDSE1_SEGEN10_POSN                      equ 0002h
LCDSE1_SEGEN10_POSITION                  equ 0002h
LCDSE1_SEGEN10_SIZE                      equ 0001h
LCDSE1_SEGEN10_LENGTH                    equ 0001h
LCDSE1_SEGEN10_MASK                      equ 0004h
LCDSE1_SEGEN11_POSN                      equ 0003h
LCDSE1_SEGEN11_POSITION                  equ 0003h
LCDSE1_SEGEN11_SIZE                      equ 0001h
LCDSE1_SEGEN11_LENGTH                    equ 0001h
LCDSE1_SEGEN11_MASK                      equ 0008h
LCDSE1_SEGEN12_POSN                      equ 0004h
LCDSE1_SEGEN12_POSITION                  equ 0004h
LCDSE1_SEGEN12_SIZE                      equ 0001h
LCDSE1_SEGEN12_LENGTH                    equ 0001h
LCDSE1_SEGEN12_MASK                      equ 0010h
LCDSE1_SEGEN13_POSN                      equ 0005h
LCDSE1_SEGEN13_POSITION                  equ 0005h
LCDSE1_SEGEN13_SIZE                      equ 0001h
LCDSE1_SEGEN13_LENGTH                    equ 0001h
LCDSE1_SEGEN13_MASK                      equ 0020h
LCDSE1_SEGEN14_POSN                      equ 0006h
LCDSE1_SEGEN14_POSITION                  equ 0006h
LCDSE1_SEGEN14_SIZE                      equ 0001h
LCDSE1_SEGEN14_LENGTH                    equ 0001h
LCDSE1_SEGEN14_MASK                      equ 0040h
LCDSE1_SEGEN15_POSN                      equ 0007h
LCDSE1_SEGEN15_POSITION                  equ 0007h
LCDSE1_SEGEN15_SIZE                      equ 0001h
LCDSE1_SEGEN15_LENGTH                    equ 0001h
LCDSE1_SEGEN15_MASK                      equ 0080h

// Register: LCDSE2
#define LCDSE2 LCDSE2
LCDSE2                                   equ 0F5Ch
// bitfield definitions
LCDSE2_LCDSE2_POSN                       equ 0000h
LCDSE2_LCDSE2_POSITION                   equ 0000h
LCDSE2_LCDSE2_SIZE                       equ 0008h
LCDSE2_LCDSE2_LENGTH                     equ 0008h
LCDSE2_LCDSE2_MASK                       equ 00FFh
LCDSE2_SE16_POSN                         equ 0000h
LCDSE2_SE16_POSITION                     equ 0000h
LCDSE2_SE16_SIZE                         equ 0001h
LCDSE2_SE16_LENGTH                       equ 0001h
LCDSE2_SE16_MASK                         equ 0001h
LCDSE2_SE17_POSN                         equ 0001h
LCDSE2_SE17_POSITION                     equ 0001h
LCDSE2_SE17_SIZE                         equ 0001h
LCDSE2_SE17_LENGTH                       equ 0001h
LCDSE2_SE17_MASK                         equ 0002h
LCDSE2_SE18_POSN                         equ 0002h
LCDSE2_SE18_POSITION                     equ 0002h
LCDSE2_SE18_SIZE                         equ 0001h
LCDSE2_SE18_LENGTH                       equ 0001h
LCDSE2_SE18_MASK                         equ 0004h
LCDSE2_SE19_POSN                         equ 0003h
LCDSE2_SE19_POSITION                     equ 0003h
LCDSE2_SE19_SIZE                         equ 0001h
LCDSE2_SE19_LENGTH                       equ 0001h
LCDSE2_SE19_MASK                         equ 0008h
LCDSE2_SE20_POSN                         equ 0004h
LCDSE2_SE20_POSITION                     equ 0004h
LCDSE2_SE20_SIZE                         equ 0001h
LCDSE2_SE20_LENGTH                       equ 0001h
LCDSE2_SE20_MASK                         equ 0010h
LCDSE2_SE21_POSN                         equ 0005h
LCDSE2_SE21_POSITION                     equ 0005h
LCDSE2_SE21_SIZE                         equ 0001h
LCDSE2_SE21_LENGTH                       equ 0001h
LCDSE2_SE21_MASK                         equ 0020h
LCDSE2_SE22_POSN                         equ 0006h
LCDSE2_SE22_POSITION                     equ 0006h
LCDSE2_SE22_SIZE                         equ 0001h
LCDSE2_SE22_LENGTH                       equ 0001h
LCDSE2_SE22_MASK                         equ 0040h
LCDSE2_SE23_POSN                         equ 0007h
LCDSE2_SE23_POSITION                     equ 0007h
LCDSE2_SE23_SIZE                         equ 0001h
LCDSE2_SE23_LENGTH                       equ 0001h
LCDSE2_SE23_MASK                         equ 0080h
LCDSE2_SEGEN16_POSN                      equ 0000h
LCDSE2_SEGEN16_POSITION                  equ 0000h
LCDSE2_SEGEN16_SIZE                      equ 0001h
LCDSE2_SEGEN16_LENGTH                    equ 0001h
LCDSE2_SEGEN16_MASK                      equ 0001h
LCDSE2_SEGEN17_POSN                      equ 0001h
LCDSE2_SEGEN17_POSITION                  equ 0001h
LCDSE2_SEGEN17_SIZE                      equ 0001h
LCDSE2_SEGEN17_LENGTH                    equ 0001h
LCDSE2_SEGEN17_MASK                      equ 0002h
LCDSE2_SEGEN18_POSN                      equ 0002h
LCDSE2_SEGEN18_POSITION                  equ 0002h
LCDSE2_SEGEN18_SIZE                      equ 0001h
LCDSE2_SEGEN18_LENGTH                    equ 0001h
LCDSE2_SEGEN18_MASK                      equ 0004h
LCDSE2_SEGEN19_POSN                      equ 0003h
LCDSE2_SEGEN19_POSITION                  equ 0003h
LCDSE2_SEGEN19_SIZE                      equ 0001h
LCDSE2_SEGEN19_LENGTH                    equ 0001h
LCDSE2_SEGEN19_MASK                      equ 0008h
LCDSE2_SEGEN20_POSN                      equ 0004h
LCDSE2_SEGEN20_POSITION                  equ 0004h
LCDSE2_SEGEN20_SIZE                      equ 0001h
LCDSE2_SEGEN20_LENGTH                    equ 0001h
LCDSE2_SEGEN20_MASK                      equ 0010h
LCDSE2_SEGEN21_POSN                      equ 0005h
LCDSE2_SEGEN21_POSITION                  equ 0005h
LCDSE2_SEGEN21_SIZE                      equ 0001h
LCDSE2_SEGEN21_LENGTH                    equ 0001h
LCDSE2_SEGEN21_MASK                      equ 0020h
LCDSE2_SEGEN22_POSN                      equ 0006h
LCDSE2_SEGEN22_POSITION                  equ 0006h
LCDSE2_SEGEN22_SIZE                      equ 0001h
LCDSE2_SEGEN22_LENGTH                    equ 0001h
LCDSE2_SEGEN22_MASK                      equ 0040h
LCDSE2_SEGEN23_POSN                      equ 0007h
LCDSE2_SEGEN23_POSITION                  equ 0007h
LCDSE2_SEGEN23_SIZE                      equ 0001h
LCDSE2_SEGEN23_LENGTH                    equ 0001h
LCDSE2_SEGEN23_MASK                      equ 0080h

