GopalSaraf/Practicals/PSDL/include/proc/pic18f6493.inc
#define S42C1                            BANKMASK(LCDDATA11), 2, a
#define S42C2                            BANKMASK(LCDDATA17), 2, a
#define S42C3                            BANKMASK(LCDDATA23), 2, a
#define S43C0                            BANKMASK(LCDDATA5), 3, a
#define S43C1                            BANKMASK(LCDDATA11), 3, a
#define S43C2                            BANKMASK(LCDDATA17), 3, a
#define S43C3                            BANKMASK(LCDDATA23), 3, a
#define S44C0                            BANKMASK(LCDDATA5), 4, a
#define S44C1                            BANKMASK(LCDDATA11), 4, a
#define S44C2                            BANKMASK(LCDDATA17), 4, a
#define S44C3                            BANKMASK(LCDDATA23), 4, a
#define S45C0                            BANKMASK(LCDDATA5), 5, a
#define S45C1                            BANKMASK(LCDDATA11), 5, a
#define S45C2                            BANKMASK(LCDDATA17), 5, a
#define S45C3                            BANKMASK(LCDDATA23), 5, a
#define S46C0                            BANKMASK(LCDDATA5), 6, a
#define S46C1                            BANKMASK(LCDDATA11), 6, a
#define S46C2                            BANKMASK(LCDDATA17), 6, a
#define S46C3                            BANKMASK(LCDDATA23), 6, a
#define S47C0                            BANKMASK(LCDDATA5), 7, a
#define S47C1                            BANKMASK(LCDDATA11), 7, a
#define S47C2                            BANKMASK(LCDDATA17), 7, a
#define S47C3                            BANKMASK(LCDDATA23), 7, a
#define S4C0                             BANKMASK(LCDDATA0), 4, a
#define S4C1                             BANKMASK(LCDDATA6), 4, a
#define S4C2                             BANKMASK(LCDDATA12), 4, a
#define S4C3                             BANKMASK(LCDDATA18), 4, a
#define S5C0                             BANKMASK(LCDDATA0), 5, a
#define S5C1                             BANKMASK(LCDDATA6), 5, a
#define S5C2                             BANKMASK(LCDDATA12), 5, a
#define S5C3                             BANKMASK(LCDDATA18), 5, a
#define S6C0                             BANKMASK(LCDDATA0), 6, a
#define S6C1                             BANKMASK(LCDDATA6), 6, a
#define S6C2                             BANKMASK(LCDDATA12), 6, a
#define S6C3                             BANKMASK(LCDDATA18), 6, a
#define S7C0                             BANKMASK(LCDDATA0), 7, a
#define S7C1                             BANKMASK(LCDDATA6), 7, a
#define S7C2                             BANKMASK(LCDDATA12), 7, a
#define S7C3                             BANKMASK(LCDDATA18), 7, a
#define S8C0                             BANKMASK(LCDDATA1), 0, a
#define S8C1                             BANKMASK(LCDDATA7), 0, a
#define S8C2                             BANKMASK(LCDDATA13), 0, a
#define S8C3                             BANKMASK(LCDDATA19), 0, a
#define S9C0                             BANKMASK(LCDDATA1), 1, a
#define S9C1                             BANKMASK(LCDDATA7), 1, a
#define S9C2                             BANKMASK(LCDDATA13), 1, a
#define S9C3                             BANKMASK(LCDDATA19), 1, a
#define SBOREN                           BANKMASK(RCON), 6, a
#define SCK                              BANKMASK(PORTC), 3, a
#define SCKP                             BANKMASK(BAUDCON1), 4, a
#define SCKP1                            BANKMASK(BAUDCON1), 4, a
#define SCL                              BANKMASK(PORTC), 3, a
#define SCS0                             BANKMASK(OSCCON), 0, a
#define SCS1                             BANKMASK(OSCCON), 1, a
#define SDA                              BANKMASK(PORTC), 4, a
#define SDI                              BANKMASK(PORTC), 4, a
#define SDO                              BANKMASK(PORTC), 5, a
#define SE0                              BANKMASK(LCDSE0), 0, b
#define SE1                              BANKMASK(LCDSE0), 1, b
#define SE10                             BANKMASK(LCDSE1), 2, b
#define SE11                             BANKMASK(LCDSE1), 3, b
#define SE12                             BANKMASK(LCDSE1), 4, b
#define SE13                             BANKMASK(LCDSE1), 5, b
#define SE14                             BANKMASK(LCDSE1), 6, b
#define SE15                             BANKMASK(LCDSE1), 7, b
#define SE16                             BANKMASK(LCDSE2), 0, b
#define SE17                             BANKMASK(LCDSE2), 1, b
#define SE18                             BANKMASK(LCDSE2), 2, b
#define SE19                             BANKMASK(LCDSE2), 3, b
#define SE2                              BANKMASK(LCDSE0), 2, b
#define SE20                             BANKMASK(LCDSE2), 4, b
#define SE21                             BANKMASK(LCDSE2), 5, b
#define SE22                             BANKMASK(LCDSE2), 6, b
#define SE23                             BANKMASK(LCDSE2), 7, b
#define SE24                             BANKMASK(LCDSE3), 0, b
#define SE25                             BANKMASK(LCDSE3), 1, b
#define SE26                             BANKMASK(LCDSE3), 2, b
#define SE27                             BANKMASK(LCDSE3), 3, b
#define SE28                             BANKMASK(LCDSE3), 4, b
#define SE29                             BANKMASK(LCDSE3), 5, b
#define SE3                              BANKMASK(LCDSE0), 3, b
#define SE30                             BANKMASK(LCDSE3), 6, b
#define SE31                             BANKMASK(LCDSE3), 7, b
#define SE4                              BANKMASK(LCDSE0), 4, b
#define SE5                              BANKMASK(LCDSE0), 5, b
#define SE6                              BANKMASK(LCDSE0), 6, b
#define SE7                              BANKMASK(LCDSE0), 7, b
#define SE8                              BANKMASK(LCDSE1), 0, b
#define SE9                              BANKMASK(LCDSE1), 1, b
#define SEG0                             BANKMASK(PORTD), 0, a
#define SEG0COM0                         BANKMASK(LCDDATA0), 0, a
#define SEG0COM1                         BANKMASK(LCDDATA6), 0, a
#define SEG0COM2                         BANKMASK(LCDDATA12), 0, a
#define SEG0COM3                         BANKMASK(LCDDATA18), 0, a
#define SEG1                             BANKMASK(PORTD), 1, a
#define SEG10                            BANKMASK(PORTB), 3, a
#define SEG10COM0                        BANKMASK(LCDDATA1), 2, a
#define SEG10COM1                        BANKMASK(LCDDATA7), 2, a
#define SEG10COM2                        BANKMASK(LCDDATA13), 2, a
#define SEG10COM3                        BANKMASK(LCDDATA19), 2, a
#define SEG11                            BANKMASK(PORTB), 4, a
#define SEG11COM0                        BANKMASK(LCDDATA1), 3, a
#define SEG11COM1                        BANKMASK(LCDDATA7), 3, a
#define SEG11COM2                        BANKMASK(LCDDATA13), 3, a
#define SEG11COM3                        BANKMASK(LCDDATA19), 3, a
#define SEG12                            BANKMASK(PORTC), 3, a
#define SEG12COM0                        BANKMASK(LCDDATA1), 4, a
#define SEG12COM1                        BANKMASK(LCDDATA7), 4, a
#define SEG12COM2                        BANKMASK(LCDDATA13), 4, a
#define SEG12COM3                        BANKMASK(LCDDATA19), 4, a
#define SEG13                            BANKMASK(PORTC), 2, a
#define SEG13COM0                        BANKMASK(LCDDATA1), 5, a
#define SEG13COM1                        BANKMASK(LCDDATA7), 5, a
#define SEG13COM2                        BANKMASK(LCDDATA13), 5, a
#define SEG13COM3                        BANKMASK(LCDDATA19), 5, a
#define SEG14                            BANKMASK(PORTA), 4, a
#define SEG14COM0                        BANKMASK(LCDDATA1), 6, a
#define SEG14COM1                        BANKMASK(LCDDATA7), 6, a
#define SEG14COM2                        BANKMASK(LCDDATA13), 6, a
#define SEG14COM3                        BANKMASK(LCDDATA19), 6, a
#define SEG15                            BANKMASK(PORTA), 5, a
#define SEG15COM0                        BANKMASK(LCDDATA1), 7, a
#define SEG15COM1                        BANKMASK(LCDDATA7), 7, a
#define SEG15COM2                        BANKMASK(LCDDATA13), 7, a
#define SEG15COM3                        BANKMASK(LCDDATA19), 7, a
#define SEG16                            BANKMASK(PORTA), 2, a
#define SEG16COM0                        BANKMASK(LCDDATA2), 0, a
#define SEG16COM1                        BANKMASK(LCDDATA8), 0, a
#define SEG16COM2                        BANKMASK(LCDDATA14), 0, a
#define SEG16COM3                        BANKMASK(LCDDATA20), 0, a
#define SEG17                            BANKMASK(PORTA), 3, a
#define SEG17COM0                        BANKMASK(LCDDATA2), 1, a
#define SEG17COM1                        BANKMASK(LCDDATA8), 1, a
#define SEG17COM2                        BANKMASK(LCDDATA14), 1, a
#define SEG17COM3                        BANKMASK(LCDDATA20), 1, a
#define SEG18                            BANKMASK(PORTF), 0, a
#define SEG18COM0                        BANKMASK(LCDDATA2), 2, a
#define SEG18COM1                        BANKMASK(LCDDATA8), 2, a
#define SEG18COM2                        BANKMASK(LCDDATA14), 2, a
#define SEG18COM3                        BANKMASK(LCDDATA20), 2, a
#define SEG19                            BANKMASK(PORTF), 1, a
#define SEG19COM0                        BANKMASK(LCDDATA2), 3, a
#define SEG19COM1                        BANKMASK(LCDDATA8), 3, a
#define SEG19COM2                        BANKMASK(LCDDATA14), 3, a
#define SEG19COM3                        BANKMASK(LCDDATA20), 3, a
#define SEG1COM0                         BANKMASK(LCDDATA0), 1, a
#define SEG1COM1                         BANKMASK(LCDDATA6), 1, a
#define SEG1COM2                         BANKMASK(LCDDATA12), 1, a
#define SEG1COM3                         BANKMASK(LCDDATA18), 1, a
#define SEG2                             BANKMASK(PORTD), 2, a
#define SEG20                            BANKMASK(PORTF), 2, a
#define SEG20COM0                        BANKMASK(LCDDATA2), 4, a
#define SEG20COM1                        BANKMASK(LCDDATA8), 4, a
#define SEG20COM2                        BANKMASK(LCDDATA14), 4, a
#define SEG20COM3                        BANKMASK(LCDDATA20), 4, a
#define SEG21                            BANKMASK(PORTF), 3, a
#define SEG21COM0                        BANKMASK(LCDDATA2), 5, a
#define SEG21COM1                        BANKMASK(LCDDATA8), 5, a
#define SEG21COM2                        BANKMASK(LCDDATA14), 5, a
#define SEG21COM3                        BANKMASK(LCDDATA20), 5, a
#define SEG22                            BANKMASK(PORTF), 4, a
#define SEG22COM0                        BANKMASK(LCDDATA2), 6, a
#define SEG22COM1                        BANKMASK(LCDDATA8), 6, a
#define SEG22COM2                        BANKMASK(LCDDATA14), 6, a
#define SEG22COM3                        BANKMASK(LCDDATA20), 6, a
#define SEG23                            BANKMASK(PORTF), 5, a
#define SEG23COM0                        BANKMASK(LCDDATA2), 7, a
#define SEG23COM1                        BANKMASK(LCDDATA8), 7, a
#define SEG23COM2                        BANKMASK(LCDDATA14), 7, a
#define SEG23COM3                        BANKMASK(LCDDATA20), 7, a
#define SEG24                            BANKMASK(PORTF), 6, a
#define SEG24COM0                        BANKMASK(LCDDATA3), 0, a
#define SEG24COM1                        BANKMASK(LCDDATA9), 0, a
#define SEG24COM2                        BANKMASK(LCDDATA15), 0, a
#define SEG24COM3                        BANKMASK(LCDDATA21), 0, a
#define SEG25                            BANKMASK(PORTF), 7, a
#define SEG25COM0                        BANKMASK(LCDDATA3), 1, a
#define SEG25COM1                        BANKMASK(LCDDATA9), 1, a
#define SEG25COM2                        BANKMASK(LCDDATA15), 1, a
#define SEG25COM3                        BANKMASK(LCDDATA21), 1, a
#define SEG26                            BANKMASK(PORTG), 4, a
#define SEG26COM0                        BANKMASK(LCDDATA3), 2, a
#define SEG26COM1                        BANKMASK(LCDDATA9), 2, a
#define SEG26COM2                        BANKMASK(LCDDATA15), 2, a
#define SEG26COM3                        BANKMASK(LCDDATA21), 2, a
#define SEG27                            BANKMASK(PORTG), 3, a
#define SEG27COM0                        BANKMASK(LCDDATA3), 3, a
#define SEG27COM1                        BANKMASK(LCDDATA9), 3, a
#define SEG27COM2                        BANKMASK(LCDDATA15), 3, a
#define SEG27COM3                        BANKMASK(LCDDATA21), 3, a
#define SEG28                            BANKMASK(PORTG), 2, a
#define SEG28COM0                        BANKMASK(LCDDATA3), 4, a
#define SEG28COM1                        BANKMASK(LCDDATA9), 4, a
#define SEG28COM2                        BANKMASK(LCDDATA15), 4, a
#define SEG28COM3                        BANKMASK(LCDDATA21), 4, a
#define SEG29                            BANKMASK(PORTG), 1, a
#define SEG29COM0                        BANKMASK(LCDDATA3), 5, a
#define SEG29COM1                        BANKMASK(LCDDATA9), 5, a
#define SEG29COM2                        BANKMASK(LCDDATA15), 5, a
#define SEG29COM3                        BANKMASK(LCDDATA21), 5, a
#define SEG2COM0                         BANKMASK(LCDDATA0), 2, a
#define SEG2COM1                         BANKMASK(LCDDATA6), 2, a
#define SEG2COM2                         BANKMASK(LCDDATA12), 2, a
#define SEG2COM3                         BANKMASK(LCDDATA18), 2, a
#define SEG3                             BANKMASK(PORTD), 3, a
#define SEG30                            BANKMASK(PORTG), 0, a
#define SEG30COM0                        BANKMASK(LCDDATA3), 6, a
#define SEG30COM1                        BANKMASK(LCDDATA9), 6, a
#define SEG30COM2                        BANKMASK(LCDDATA15), 6, a
#define SEG30COM3                        BANKMASK(LCDDATA21), 6, a
#define SEG31                            BANKMASK(PORTE), 7, a
#define SEG31COM0                        BANKMASK(LCDDATA3), 7, a
#define SEG31COM1                        BANKMASK(LCDDATA9), 7, a
#define SEG31COM2                        BANKMASK(LCDDATA15), 7, a
#define SEG31COM3                        BANKMASK(LCDDATA21), 7, a
#define SEG32COM0                        BANKMASK(LCDDATA4), 0, a
#define SEG32COM1                        BANKMASK(LCDDATA10), 0, a
#define SEG32COM2                        BANKMASK(LCDDATA16), 0, a
#define SEG32COM3                        BANKMASK(LCDDATA22), 0, a
#define SEG33COM0                        BANKMASK(LCDDATA4), 1, a
#define SEG33COM1                        BANKMASK(LCDDATA10), 1, a
#define SEG33COM2                        BANKMASK(LCDDATA16), 1, a
#define SEG33COM3                        BANKMASK(LCDDATA22), 1, a
#define SEG34COM0                        BANKMASK(LCDDATA4), 2, a
#define SEG34COM1                        BANKMASK(LCDDATA10), 2, a
#define SEG34COM2                        BANKMASK(LCDDATA16), 2, a
#define SEG34COM3                        BANKMASK(LCDDATA22), 2, a
#define SEG35COM0                        BANKMASK(LCDDATA4), 3, a
#define SEG35COM1                        BANKMASK(LCDDATA10), 3, a
#define SEG35COM2                        BANKMASK(LCDDATA16), 3, a
#define SEG35COM3                        BANKMASK(LCDDATA22), 3, a
#define SEG36COM0                        BANKMASK(LCDDATA4), 4, a
#define SEG36COM1                        BANKMASK(LCDDATA10), 4, a
#define SEG36COM2                        BANKMASK(LCDDATA16), 4, a
#define SEG36COM3                        BANKMASK(LCDDATA22), 4, a
#define SEG37COM0                        BANKMASK(LCDDATA4), 5, a
#define SEG37COM1                        BANKMASK(LCDDATA10), 5, a
#define SEG37COM2                        BANKMASK(LCDDATA16), 5, a
#define SEG37COM3                        BANKMASK(LCDDATA22), 5, a
#define SEG38COM0                        BANKMASK(LCDDATA4), 6, a
#define SEG38COM1                        BANKMASK(LCDDATA10), 6, a
#define SEG38COM2                        BANKMASK(LCDDATA16), 6, a
#define SEG38COM3                        BANKMASK(LCDDATA22), 6, a
#define SEG39COM0                        BANKMASK(LCDDATA4), 7, a
#define SEG39COM1                        BANKMASK(LCDDATA10), 7, a
#define SEG39COM2                        BANKMASK(LCDDATA16), 7, a
#define SEG39COM3                        BANKMASK(LCDDATA22), 7, a
#define SEG3COM0                         BANKMASK(LCDDATA0), 3, a
#define SEG3COM1                         BANKMASK(LCDDATA6), 3, a
#define SEG3COM2                         BANKMASK(LCDDATA12), 3, a
#define SEG3COM3                         BANKMASK(LCDDATA18), 3, a
#define SEG4                             BANKMASK(PORTD), 4, a
#define SEG40COM0                        BANKMASK(LCDDATA5), 0, a
#define SEG40COM1                        BANKMASK(LCDDATA11), 0, a
#define SEG40COM2                        BANKMASK(LCDDATA17), 0, a
#define SEG40COM3                        BANKMASK(LCDDATA23), 0, a
#define SEG41COM0                        BANKMASK(LCDDATA5), 1, a
#define SEG41COM1                        BANKMASK(LCDDATA11), 1, a
#define SEG41COM2                        BANKMASK(LCDDATA17), 1, a
#define SEG41COM3                        BANKMASK(LCDDATA23), 1, a
#define SEG42COM0                        BANKMASK(LCDDATA5), 2, a
#define SEG42COM1                        BANKMASK(LCDDATA11), 2, a
#define SEG42COM2                        BANKMASK(LCDDATA17), 2, a
#define SEG42COM3                        BANKMASK(LCDDATA23), 2, a
#define SEG43COM0                        BANKMASK(LCDDATA5), 3, a
#define SEG43COM1                        BANKMASK(LCDDATA11), 3, a
#define SEG43COM2                        BANKMASK(LCDDATA17), 3, a
#define SEG43COM3                        BANKMASK(LCDDATA23), 3, a
#define SEG44COM0                        BANKMASK(LCDDATA5), 4, a
#define SEG44COM1                        BANKMASK(LCDDATA11), 4, a
#define SEG44COM2                        BANKMASK(LCDDATA17), 4, a
#define SEG44COM3                        BANKMASK(LCDDATA23), 4, a
#define SEG45COM0                        BANKMASK(LCDDATA5), 5, a
#define SEG45COM1                        BANKMASK(LCDDATA11), 5, a
#define SEG45COM2                        BANKMASK(LCDDATA17), 5, a
#define SEG45COM3                        BANKMASK(LCDDATA23), 5, a
#define SEG46COM0                        BANKMASK(LCDDATA5), 6, a
#define SEG46COM1                        BANKMASK(LCDDATA11), 6, a
#define SEG46COM2                        BANKMASK(LCDDATA17), 6, a
#define SEG46COM3                        BANKMASK(LCDDATA23), 6, a
#define SEG47COM0                        BANKMASK(LCDDATA5), 7, a
#define SEG47COM1                        BANKMASK(LCDDATA11), 7, a
#define SEG47COM2                        BANKMASK(LCDDATA17), 7, a
#define SEG47COM3                        BANKMASK(LCDDATA23), 7, a
#define SEG4COM0                         BANKMASK(LCDDATA0), 4, a
#define SEG4COM1                         BANKMASK(LCDDATA6), 4, a
#define SEG4COM2                         BANKMASK(LCDDATA12), 4, a
#define SEG4COM3                         BANKMASK(LCDDATA18), 4, a
#define SEG5                             BANKMASK(PORTD), 5, a
#define SEG5COM0                         BANKMASK(LCDDATA0), 5, a
#define SEG5COM1                         BANKMASK(LCDDATA6), 5, a
#define SEG5COM2                         BANKMASK(LCDDATA12), 5, a
#define SEG5COM3                         BANKMASK(LCDDATA18), 5, a
#define SEG6                             BANKMASK(PORTD), 6, a
#define SEG6COM0                         BANKMASK(LCDDATA0), 6, a
#define SEG6COM1                         BANKMASK(LCDDATA6), 6, a
#define SEG6COM2                         BANKMASK(LCDDATA12), 6, a
#define SEG6COM3                         BANKMASK(LCDDATA18), 6, a
#define SEG7                             BANKMASK(PORTD), 7, a
#define SEG7COM0                         BANKMASK(LCDDATA0), 7, a
#define SEG7COM1                         BANKMASK(LCDDATA6), 7, a
#define SEG7COM2                         BANKMASK(LCDDATA12), 7, a
#define SEG7COM3                         BANKMASK(LCDDATA18), 7, a
#define SEG8                             BANKMASK(PORTB), 1, a
#define SEG8COM0                         BANKMASK(LCDDATA1), 0, a
#define SEG8COM1                         BANKMASK(LCDDATA7), 0, a
#define SEG8COM2                         BANKMASK(LCDDATA13), 0, a
#define SEG8COM3                         BANKMASK(LCDDATA19), 0, a
#define SEG9                             BANKMASK(PORTB), 2, a
#define SEG9COM0                         BANKMASK(LCDDATA1), 1, a
#define SEG9COM1                         BANKMASK(LCDDATA7), 1, a
#define SEG9COM2                         BANKMASK(LCDDATA13), 1, a
#define SEG9COM3                         BANKMASK(LCDDATA19), 1, a
#define SEGEN0                           BANKMASK(LCDSE0), 0, b
#define SEGEN1                           BANKMASK(LCDSE0), 1, b
#define SEGEN10                          BANKMASK(LCDSE1), 2, b
#define SEGEN11                          BANKMASK(LCDSE1), 3, b
#define SEGEN12                          BANKMASK(LCDSE1), 4, b
#define SEGEN13                          BANKMASK(LCDSE1), 5, b
#define SEGEN14                          BANKMASK(LCDSE1), 6, b
#define SEGEN15                          BANKMASK(LCDSE1), 7, b
#define SEGEN16                          BANKMASK(LCDSE2), 0, b
#define SEGEN17                          BANKMASK(LCDSE2), 1, b
#define SEGEN18                          BANKMASK(LCDSE2), 2, b
#define SEGEN19                          BANKMASK(LCDSE2), 3, b
#define SEGEN2                           BANKMASK(LCDSE0), 2, b
#define SEGEN20                          BANKMASK(LCDSE2), 4, b
#define SEGEN21                          BANKMASK(LCDSE2), 5, b
#define SEGEN22                          BANKMASK(LCDSE2), 6, b
#define SEGEN23                          BANKMASK(LCDSE2), 7, b
#define SEGEN24                          BANKMASK(LCDSE3), 0, b
#define SEGEN25                          BANKMASK(LCDSE3), 1, b
#define SEGEN26                          BANKMASK(LCDSE3), 2, b
#define SEGEN27                          BANKMASK(LCDSE3), 3, b
#define SEGEN28                          BANKMASK(LCDSE3), 4, b
#define SEGEN29                          BANKMASK(LCDSE3), 5, b
#define SEGEN3                           BANKMASK(LCDSE0), 3, b
#define SEGEN30                          BANKMASK(LCDSE3), 6, b
#define SEGEN31                          BANKMASK(LCDSE3), 7, b
#define SEGEN4                           BANKMASK(LCDSE0), 4, b
#define SEGEN5                           BANKMASK(LCDSE0), 5, b
#define SEGEN6                           BANKMASK(LCDSE0), 6, b
#define SEGEN7                           BANKMASK(LCDSE0), 7, b
#define SEGEN8                           BANKMASK(LCDSE1), 0, b
#define SEGEN9                           BANKMASK(LCDSE1), 1, b
#define SEN                              BANKMASK(SSPCON2), 0, a
#define SENDB                            BANKMASK(TXSTA1), 3, a
#define SENDB1                           BANKMASK(TXSTA1), 3, a
#define SENDB2                           BANKMASK(TXSTA2), 3, a
#define SLPEN                            BANKMASK(LCDCON), 6, b
#define SMP                              BANKMASK(SSPSTAT), 7, a
#define SOSCEN                           BANKMASK(T1CON), 3, a
#define SOSCEN3                          BANKMASK(T3CON), 3, a
#define SPEN                             BANKMASK(RCSTA1), 7, a
#define SPEN1                            BANKMASK(RCSTA1), 7, a
#define SPEN2                            BANKMASK(RCSTA2), 7, a
#define SREN                             BANKMASK(RCSTA1), 5, a
#define SREN1                            BANKMASK(RCSTA1), 5, a
#define SREN2                            BANKMASK(RCSTA2), 5, a
#define SRENA                            BANKMASK(RCSTA1), 5, a
#define SS                               BANKMASK(PORTF), 7, a
#define SS2                              BANKMASK(PORTD), 7, a
#define SSPEN                            BANKMASK(SSPCON1), 5, a
#define SSPIE                            BANKMASK(PIE1), 3, a
#define SSPIF                            BANKMASK(PIR1), 3, a
